<?php

namespace Database\Seeders;

use App\Models\Product;
use Illuminate\Database\Seeder;

class ProductTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $products = [
            [
                'title' => 'Чайник Tefal KI772138',
                'slug' => 'tefal_teapot',
                'image' => 'teapot_tefal.jpg',
                'description' => 'Элегантный чайник Tefal выполнен из прочного термостойкого стекла, которое выдерживает резкие
                 перепады температуры и гарантирует долгую службу устройства. Материал не влияет на вкус воды и на 100%
                 пригоден для переработки. Чайник с полностью прозрачным корпусом и эффектной подсветкой впишется в интерьер любой кухни ',
                'characteristics' => "{\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0421\\u0435\\u0440\\u0435\\u0431\\u0440\\u044f\\u043d\\u044b\\u0439\",\"\\u0421\\u0442\\u0440\\u0430\\u043d\\u0430 \\u043f\\u0440\\u043e\\u0438\\u0437\\u0432\\u043e\\u0434\\u0441\\u0442\\u0432\\u0430:\":\"\\u041a\\u0438\\u0442\\u0430\\u0439\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c\":\"\\u0412\\u0442: 500\"}",
                'price' => 3999.00,
                'category_id' => 1,
                'brand_id' => 1
            ],
            [
                'title' => 'Тостер Tefal Morning TT2M1B10',
                'slug' => 'tefal_toaster',
                'image' => 'toaster_tefal.jpg',
                'description' => 'Сделайте каждое утро особенным вместе с тостером Morning от Tefal с двумя отделениями.
                 Его минималистичный, но при этом запоминающийся дизайн позволяет ему стать настоящим украшением любой кухни.
                 Выбирайте любой из 7 уровней подрумянивания на свой вкус, а функция "Стоп" гарантирует, что вы получите именно
                 ту корочку, которую любите больше всего. ',
                'characteristics' => "{\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0421\\u0435\\u0440\\u0435\\u0431\\u0440\\u044f\\u043d\\u044b\\u0439\",\"\\u0421\\u0442\\u0440\\u0430\\u043d\\u0430 \\u043f\\u0440\\u043e\\u0438\\u0437\\u0432\\u043e\\u0434\\u0441\\u0442\\u0432\\u0430:\":\"\\u041a\\u0438\\u0442\\u0430\\u0439\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c\":\"\\u0412\\u0442: 500\"}",
                'price' => 4399.00,
                'category_id' => 2,
                'brand_id' => 1
            ],
            [
                'title' => 'Ручной миксер HT460138 Tefal',
                'slug' => 'tefal_mixer',
                'image' => 'mixer_tefal.jpg',
                'description' => 'Ручной миксер Tefal, созданный для удовлетворения ваших ожиданий, идеально подходит для
                всех ваших кухонных задач. Мощность 500 Вт обеспечивает надежную работу и позволяет миксеру справиться даже
                 с самыми большими кулинарными задачами. Устройство оснащено миксерами и венчиками из нержавеющей стали,
                 благодаря которым вы легко сможете замесить тесто, взбить сливки и многое другое. Откройте для себя универсальное
                 устройство с множеством возможностей!',
                'characteristics' => "{\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0435\\u0439\":\"5\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c\":\"\\u0412\\u0442: 500\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u041a\\u0440\\u0430\\u0441\\u043d\\u044b\\u0439\"}",
                'price' => 6752.00,
                'category_id' => 3,
                'brand_id' => 1
            ],
            [
                'title' => 'Погружной блендер Optitouch HB833132 Tefal',
                'slug' => 'tefal_blender',
                'image' => 'blender_tefal.jpg',
                'description' => 'Специальная защита от брызг и нескользящая ручка разработаны для комфорта использования.
                 Съемные части блендера можно мыть в посудомоечной машине. В комплект входят удобный мерный стакан объемом 800 мл,
                  измельчитель объемом 500 мл для легкого измельчения разнообразных продуктов и насадка-венчик для простого взбивания ингредиентов.',
                'characteristics' => "{\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c\":\"\\u0412\\u0442: 600\",\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0435\\u0439\":\"160\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0411\\u0435\\u043b\\u044b\\u0439\"}",
                'price' => 4399.00,
                'category_id' => 4,
                'brand_id' => 1
            ],
            [
                'title' => 'Соковыжималка ZE610D Tefal',
                'slug' => 'tefal_juicer',
                'image' => 'juicer_tefal.jpg',
                'description' => 'Эргономичная ручка с системой блокировки обеспечивает комфортное использование.
                 С 1,2-литровым контейнером для сока и 2-литровым контейнером для мякоти можно приготовить
                 большое количество сока.',
                'characteristics' => "{\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0443\\u0440\\u043e\\u0432\\u043d\\u0435\\u0439 \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0438\":2,\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c(\\u0412\\u0442)\":800,\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0411\\u0435\\u0436\\u0435\\u0432\\u044b\\u0439\"}",
                'price' => 23267.00,
                'category_id' => 5,
                'brand_id' => 1
            ],
            [
                'title' => 'Вафельница Tefal Waffle Time WD170D38',
                'slug' => 'tefal_waffleIron',
                'image' => 'waffleIron_tefal.jpg',
                'description' => 'Хороший выбор для тех, кто любит завтракать свежей выпечкой и пить чай с горячими вафлями.
                С её помощью вы можете воплотить в реальность разнообразные рецепты и создать превосходный десерт,
                 который можно есть не только сам по себе, но и со взбитыми сливками, вареньем или сгущённым молоком.  ',
                'characteristics' => "{\"\\u0410\\u043d\\u0442\\u0438\\u043f\\u0440\\u0438\\u0433\\u0430\\u0440\\u043d\\u043e\\u0435 \\u043f\\u043e\\u043a\\u0440\\u044b\\u0442\\u0438\\u0435\":\"\\u0415\\u0441\\u0442\\u044c\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c\":\"700 \\u0412\\u0442\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0411\\u0435\\u043b\\u044b\\u0439\"}",
                'price' => 6199.00,
                'category_id' => 6,
                'brand_id' => 1
            ],
            [
                'title' => 'Чайник Polaris PWK 1724CA',
                'slug' => 'polaris_teapot',
                'image' => 'teapot_polaris.jpg',
                'description' => 'Английский контроллер Strix, обеспечивающий надежность и долговечность.
                Шкала контроля уровня воды.
                Корпус из высококачественной нержавеющей стали.
                Безопасное открытие крышки нажатием на кнопку.',
                'characteristics' => "{\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0421\\u0435\\u0440\\u0435\\u0431\\u0440\\u044f\\u043d\\u044b\\u0439\",\"\\u0421\\u0442\\u0440\\u0430\\u043d\\u0430 \\u043f\\u0440\\u043e\\u0438\\u0437\\u0432\\u043e\\u0434\\u0441\\u0442\\u0432\\u0430\":\"\\u041a\\u0438\\u0442\\u0430\\u0439\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c, \\u0412\\u0442\":\"700\"}",
                'price' => 4800.00,
                'category_id' => 1,
                'brand_id' => 2
            ],

            [
                'title' => 'Тостер Polaris PET 0925',
                'slug' => 'polaris_toaster',
                'image' => 'toaster_polaris.jpg',
                'description' => 'Функции подогрева и размораживания; кнопка отмены.Корпус из нержавеющей стали.
                6 степеней обжаривания.',
//                'characteristics' => json_encode([
//                    'Цвет' => 'Черный',
//                    'Страна производства' => 'Китай',
//                    'Мощность' => 'Вт: 900',
//                ]),
                'characteristics' => "{\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0421\\u0435\\u0440\\u0435\\u0431\\u0440\\u044f\\u043d\\u044b\\u0439\",\"\\u0421\\u0442\\u0440\\u0430\\u043d\\u0430 \\u043f\\u0440\\u043e\\u0438\\u0437\\u0432\\u043e\\u0434\\u0441\\u0442\\u0432\\u0430\":\"\\u041a\\u0438\\u0442\\u0430\\u0439\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c, \\u0412\\u0442\":\"700\"}",
                'price' => 3100.00,
                'category_id' => 2,
                'brand_id' => 2
            ],
            [
                'title' => 'Миксер Polaris PHM 8026A Silent',
                'slug' => 'polaris_mixer',
                'image' => 'mixer_polaris.jpg',
                'description' => 'Удобный миксер с прочным корпусом с отделкой из нержавеющей стали просто незаменим для
                 тех, кто любит много готовить, печь блинчики и другие десерты.',
                'characteristics' => "{\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0435\\u0439\":\"5\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c, \\u0412\\u0442\":\"850\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u041e\\u0440\\u0430\\u043d\\u0436\\u0435\\u0432\\u044b\\u0439\"}",
                'price' => 5200.00,
                'category_id' => 3,
                'brand_id' => 2
            ],
            [
                'title' => 'Блендер Polaris PHB 1587 Shine Collection',
                'slug' => 'polaris_blender',
                'image' => 'blender_polaris.jpg',
                'description' => 'Технология PROtect+ двойная защита двигателя (от перегрева и перегрузки) обеспечивает
                 надежность и долговечность.PRO Blade - ножи особой формы из нержавеющей стали обеспечивают на 20%
                 более эффективное измельчение и смешивание даже твердых видов продуктов.',
                'characteristics' => "{\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c, \\u0412\\u0442\":\"1500\",\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0435\\u0439:\":\"8\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0421\\u0435\\u0440\\u0435\\u0431\\u0440\\u044f\\u043d\\u044b\\u0439\"}",
                'price' => 9499.00,
                'category_id' => 4,
                'brand_id' => 2
            ],
            [
                'title' => 'Соковыжималка Polaris PEA 1535АL',
                'slug' => 'polaris_juicer',
                'image' => 'juicer_polaris.jpg',
                'description' => 'Широкий желоб для подачи целых фруктов и овощей: диаметр 85 мм.
                Отжим сока целых фруктов и овощей.',
                'characteristics' => "{\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0443\\u0440\\u043e\\u0432\\u043d\\u0435\\u0439 \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0438\":\"2\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c (\\u0412\\u0442)\":\"1500\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0427\\u0435\\u0440\\u043d\\u044b\\u0439\"}",
                'price' => 23267.00,
                'category_id' => 5,
                'brand_id' => 2
            ],
            [
                'title' => 'Вафельница Polaris PST 1001',
                'slug' => 'polaris_waffleIron',
                'image' => 'waffleIron_polaris.jpg',
                'description' => '5 пар съемных панелей: сэндвич, гриль, венская вафля, орешки, тонкая вафля.
                Антипригарное покрытие Biotore.
                Автоматический контроль температуры. ',
                'characteristics' => "{\"\\u0410\\u043d\\u0442\\u0438\\u043f\\u0440\\u0438\\u0433\\u0430\\u0440\\u043d\\u043e\\u0435 \\u043f\\u043e\\u043a\\u0440\\u044b\\u0442\\u0438\\u0435\":\"\\u0415\\u0441\\u0442\\u044c\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c\":\"850 \\u0412\\u0442\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0411\\u0435\\u043b\\u044b\\u0439\"}",
                'price' => 7399.00,
                'category_id' => 6,
                'brand_id' => 2
            ],
            [
                'title' => 'Чайник Vitek VT-1154',
                'slug' => 'vitek_teapot',
                'image' => 'teapot_vitek.jpg',
                'description' => 'Чайник Vitek VT-1154 объемом 1,7 л придется по вкусу тем, кто старается окружать себя
                 качественными и стильными кухонными приборами. Внешний вид прибора очаровывает с первого взгляда! ',
                'characteristics' => "{\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0427\\u0435\\u0440\\u043d\\u044b\\u0439\",\"\\u0421\\u0442\\u0440\\u0430\\u043d\\u0430 \\u043f\\u0440\\u043e\\u0438\\u0437\\u0432\\u043e\\u0434\\u0441\\u0442\\u0432\\u0430\":\"\\u041a\\u0438\\u0442\\u0430\\u0439\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c, \\u0412\\u0442\":\"800\"}",
                'price' => 6320.00,
                'category_id' => 1,
                'brand_id' => 3
            ],

            [
                'title' => 'Тостер Vitek VT-1581',
                'slug' => 'vitek_toaster',
                'image' => 'toaster_vitek.jpg',
                'description' => 'Начать утро с аромата поджаренного хлеба позволит вам стильный тостер, рассчитанный на
                 два ломтика. Корпус прибора выполнен из термостойкого пластика черного цвета, который гармонично
                 сочетается со стальными элементами. ',
                'characteristics' => "{\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0411\\u0435\\u043b\\u044b\\u0439\",\"\\u0421\\u0442\\u0440\\u0430\\u043d\\u0430 \\u043f\\u0440\\u043e\\u0438\\u0437\\u0432\\u043e\\u0434\\u0441\\u0442\\u0432\\u0430\":\"\\u041a\\u0438\\u0442\\u0430\\u0439\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c\":\"\\u0412\\u0442: 750\"}",
                'price' => 2105.00,
                'category_id' => 2,
                'brand_id' => 3
            ],
            [
                'title' => 'Миксер Vitek VT-1404',
                'slug' => 'vitek_mixer',
                'image' => 'mixer_vitek.jpg',
                'description' => 'Решить любую кондитерскую задачу поможет вам ручной миксер. Достижению безупречного
                 результата и особому комфорту в использовании способствуют 5 скоростных режимов прибора.',
                'characteristics' => "{\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0435\\u0439\":\"5\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c, \\u0412\\u0442\":\"700\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0421\\u0435\\u0440\\u0435\\u0431\\u0440\\u044f\\u043d\\u044b\\u0439\"}",
                'price' => 3390.00,
                'category_id' => 3,
                'brand_id' => 3
            ],
            [
                'title' => 'Блендер погружной Vitek VT-3000',
                'slug' => 'vitek_blender',
                'image' => 'blender_vitek.jpg',
                'description' => 'Блендерный набор позволит вам убедиться, что от ежедневного процесса приготовления
                 пищи можно и даже нужно получать удовольствие.  Рабочая часть погружного блендера, венчика и ножи
                  изготовлены из нержавеющей стали, легкой в уходе, обладающей особой прочностью.',
                'characteristics' => "{\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c, \\u0412\\u0442\":\"800\",\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0435\\u0439\":\"3\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0411\\u0435\\u043b\\u044b\\u0439\"}",
                'price' => 2150.00,
                'category_id' => 4,
                'brand_id' => 3
            ],
            [
                'title' => 'Соковыжималка Vitek VT-3653',
                'slug' => 'vitek_juicer',
                'image' => 'juicer_vitek.jpg',
                'description' => 'Модель оснащена прочными стальными фильтрами и лезвиями из нержавеющей стали, которые
                 легко моются и не изнашивается со временем, коническая форма фильтров позволяет наилучшим образом
                 организовать отброс мякоти в контейнер',
                'characteristics' => "{\"\\u041a\\u043e\\u043b\\u0438\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0443\\u0440\\u043e\\u0432\\u043d\\u0435\\u0439 \\u0441\\u043a\\u043e\\u0440\\u043e\\u0441\\u0442\\u0438\":\"3\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c (\\u0412\\u0442)\":\"1000\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0421\\u0442\\u0430\\u043b\\u044c\\u043d\\u043e\\u0439\"}",
                'price' => 9800.00,
                'category_id' => 5,
                'brand_id' => 3
            ],
            [
                'title' => 'Вафельница Vitek VT-2624',
                'slug' => 'vitek_waffleIron',
                'image' => 'waffleIron_vitek.jpg',
                'description' => 'Баловать близких вкусной выпечкой так часто, как того хочется, поможет вафельница.
                В безупречном результате можно не сомневаться: антипригарное покрытие гарантирует идеальное приготовление
                двух видов классических венских вафель ',
                'characteristics' => "{\"\\u0410\\u043d\\u0442\\u0438\\u043f\\u0440\\u0438\\u0433\\u0430\\u0440\\u043d\\u043e\\u0435 \\u043f\\u043e\\u043a\\u0440\\u044b\\u0442\\u0438\\u0435\":\"\\u0415\\u0441\\u0442\\u044c\",\"\\u041c\\u043e\\u0449\\u043d\\u043e\\u0441\\u0442\\u044c\":\"750 \\u0412\\u0442\",\"\\u0426\\u0432\\u0435\\u0442\":\"\\u0427\\u0435\\u0440\\u043d\\u044b\\u0439\"}",
                'price' => 2120.00,
                'category_id' => 6,
                'brand_id' => 3
            ],
        ];

        foreach ($products as $product) {
            Product::query()->create($product);

        }
    }
}
